# 5. Программа запрашивает у пользователя строку чисел, разделенных пробелом.
# При нажатии Enter должна выводиться сумма чисел.
# Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
# Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
# Но если вместо числа вводится специальный символ, выполнение программы завершается.
# Если специальный символ введен после нескольких чисел, то вначале нужно добавить сумму этих чисел
# к полученной ранее сумме и после этого завершить программу.

numbers = []
total_result = 0

while 'q' not in numbers:

    numbers = input("Введите в строку числа через пробелы. Выход - q: ").split()
    numbers_copy = []
    for number in numbers:
        try:
            number = float(number)
            numbers_copy.append(number)
        except ValueError:
            if number == 'q':
                break
    result = sum(numbers_copy)
    total_result += result
    print(f'{result} ({total_result})')
