# 4. Программа принимает действительное положительное число x и целое отрицательное число y.
# Необходимо выполнить возведение числа x в степень y. Задание необходимо реализовать в виде функции my_func(x, y).
# При решении задания необходимо обойтись без встроенной функции возведения числа в степень.
# Подсказка: попробуйте решить задачу двумя способами. Первый — возведение в степень с помощью оператора **.
# Второй — более сложная реализация без оператора **, предусматривающая использование цикла."""


def my_func(x, y):
    return round((x ** y), 5)


def my_func1(x, y):
    exp = x
    for i in range(1, abs(y)):
        exp *= x
    result = round((1 / exp), 5)
    return result


while True:
    try:
        num1 = float(input("Введите действительное положительное число "))
    except ValueError:
        print("Необходимо ввести число")
    else:
        if num1 <= 0:
            print("Число должно быть положительное.")
        else:
            break
while True:
    try:
        num2 = int(input("Введите целое отрицательное число "))
    except ValueError:
        print("Необходимо ввести целое отрицательное число")
    else:
        if num2 >= 0:
            print("Число должно быть отрицательное.")
        else:
            break
print(f'Расчет 1: {num1} в {num2}-й степени равно: {my_func(num1, num2)}')
print(f'Расчет 2: {num1} в {num2}-й степени равно: {my_func1(num1, num2)}')
