# 2. Для списка реализовать обмен значений соседних элементов, т.е.
# Значениями обмениваются элементы с индексами 0 и 1, 2 и 3 и т.д.
# При нечетном количестве элементов последний сохранить на своем месте.
# Для заполнения списка элементов необходимо использовать функцию input().

user_list = []
i = 0
while not user_list:
    number = int(input('Введите количество элементов списка (2 и больше): '))
    if number <= 0:
        print('Количество элементов не может быть равно или меньше нуля')
    elif number == 1:
        print('Получится список из 1 элемента, нечего будет менять местами')
    else:
        while i < number:
            el = input(f'Введите {i + 1}-й элемент списка: ')
            user_list.append(el)
            i += 1
print("Получился список:\n", user_list)

for i in range(0, len(user_list)-1, 2):
    user_list[i], user_list[i+1] = user_list[i+1], user_list[i]
print('Если поменять местами значения соседних элементов, то получится список:\n', user_list)
