# 1. Поработайте с переменными, создайте несколько, выведите на экран,
# запросите у пользователя несколько чисел и строк и сохраните в переменные, выведите на экран.

# Калькулятор индекса массы тела
# Расчитывается по формуле: вес (кг) делённый на рост (в метрах), возведённый в квадрат.
# Для мужчин и женщин минимальное значение нормы разное, остальная градация значений от пола не зависит.

index_min = 0

while True:
    gender = input('Ваш пол (м/ж)? ')

    if gender == 'ж' or gender == 'Ж':
        index_min = 18.5
        break
    elif gender == 'м' or gender == 'М':
        index_min = 19
        break
    else:
        print('Требуется уточнить пол.')

weight = int(input('Ваш вес (кг)? '))
height = int(input('Ваш рост (см)? '))

# расчёт итога с округлением до десятых без использования round
user_index = float("%.1f" % (weight / (height / 100) ** 2))
print('Индекс массы тела:', user_index)

if user_index < index_min:
    print("У Вас дефицит массы тела.")
elif user_index < 25:
    print("Ваш вес в норме.")
elif user_index < 30:
    print("У Вас незначительный избыточный вес.")
elif user_index < 40:
    print("У Вас ожирение.")
else:
    print("У Вас ожирение, опасное для здоровья.")
