# 5. Запросите у пользователя значения выручки и издержек фирмы.
# Определите, с каким финансовым результатом работает фирма
# (прибыль — выручка больше издержек, или убыток — издержки больше выручки).
# Выведите соответствующее сообщение. Если фирма отработала с прибылью,
# вычислите рентабельность выручки (соотношение прибыли к выручке).
# Далее запросите численность сотрудников фирмы и определите прибыль фирмы в расчете на одного сотрудника


revenue = int(input('Введите сумму выручки (руб.): '))
costs = int(input('Введите сумму издержек (руб.): '))
result = revenue - costs
if result > 0:
    print(f'Прибыль составила {result} руб.')
    profit = result / revenue * 100
    staff_number = int(input('Введите количество сотрудников: '))
    profit_per_staff = result / staff_number
    print(
        f'Рентабельность: {"%.1f" % profit}%, прибыль в расчёте на 1 сотрудника: {"%.2f" % profit_per_staff} руб.')
else:
    print(f'Получен убыток {result} руб.')
