# Спортсмен занимается ежедневными пробежками. В первый день его результат составил a километров.
# Каждый день спортсмен увеличивал результат на 10 % относительно предыдущего.
# Требуется определить номер дня, на который общий результат спортсмена составить не менее b километров.
# Программа должна принимать значения параметров a и b и выводить одно натуральное число — номер дня.

a = float(input('Результат пробежки спортсмена в первый день (км)? '))
b = float(input('Какой результат пробежки требуется (км)? '))
result = a
i = 1
while result < b:
    result *= 1.1
    i += 1
print(f'Спортсмен пробежит {b} км на {i}-й день тренировок')
