# 2. Реализовать класс Road (дорога), в котором определить атрибуты: length (длина), width (ширина).
# Значения данных атрибутов должны передаваться при создании экземпляра класса.
# Атрибуты сделать защищенными. Определить метод расчета массы асфальта,
# необходимого для покрытия всего дорожного полотна. Использовать формулу: длина * ширина * масса асфальта
# для покрытия одного кв метра дороги асфальтом, толщиной в 1 см * число см толщины полотна. Проверить работу метода.
# Например: 20м * 5000м * 25кг * 5см = 12500 т

class Road:

    def __init__(self, lth, wth):
        self._length = lth
        self._width = wth
        self.weight_per_m2 = 25
        self.thick = 5

    def weight_asphalt(self):
        weight = self._length * self._width * self.weight_per_m2 / 1000 * self.thick
        print(f'Масса асфальта: {weight} тонн.')


road_1 = Road(5000, 20)
road_1.weight_asphalt()
