# 1. Создать класс TrafficLight (светофор) и определить у него один атрибут color (цвет) и метод running (запуск).
# Атрибут реализовать как приватный. В рамках метода реализовать переключение светофора в режимы:
# красный, желтый, зеленый.
# Продолжительность первого состояния (красный) составляет 7 секунд, второго (желтый) — 2 секунды,
# третьего (зеленый) — на ваше усмотрение.
# Переключение между режимами должно осуществляться только в указанном порядке (красный, желтый, зеленый).
# Проверить работу примера, создав экземпляр и вызвав описанный метод.
# Задачу можно усложнить, реализовав проверку порядка режимов, и при его нарушении выводить соответствующее
# сообщение и завершать скрипт.

from sys import stdout
from time import sleep


class TrafficLight:
    __color = {'красный': ('[31m', 7), 'жёлтый': ('[33m', 2), 'зелёный': ('[32m', 3)}

    def running(self):
        for key, val in self.__color.items():
            stdout.write('\r')
            stdout.write(f'\033{val[0]}{key}')
            sleep(val[1])


t_l = TrafficLight()
t_l.running()
